Revit 2027 API
FamilySizeTableManager.GetSizeTable Method
 Get a FamilySizeTable by name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilySizeTable GetSizeTable(
	string tableName
)
Public Function GetSizeTable (
	tableName As String
) As FamilySizeTable
public:
FamilySizeTable^ GetSizeTable(
	String^ tableName
)
member GetSizeTable :
        tableName : string -> FamilySizeTable
Parameters
tableName String
 The FamilySizeTable name.
Return Value
FamilySizeTable
 The FamilySizeTable of a given name.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FamilySizeTableManager Class
Autodesk.Revit.DB Namespace